Clearer docs and visual
